---
kind: other
id: Methods.T:Autodesk.Revit.DB.SketchPlane
source: html/843c4985-addc-abf8-4db1-aa2f05212e9f.htm
---
# SketchPlane Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.